       IDENTIFICATION DIVISION.
       PROGRAM-ID. no-yes-end-loop-very-sussy.

       PROCEDURE DIVISION.
       PERFORM UNTIL 1 < 0
          DISPLAY "ඞ"
          CONTINUE AFTER 30 SECONDS
       END-PERFORM.
       STOP RUN.
